// src\screen(구버전)\healthscreen\legal_conset_text.js
// src\screen(구버전)\healthscreen\legal_conset_text.js
// src/screen(구버전)/healthscreen/legal_conset_text.js
export const privacy_usage_agreement = `H&S biolab (이하 '회사')에서는 간편인증서비스 제공을 위하여 개인정보를 이용하고자 합니다. 

1. 개인정보 수집·이용 목적
-이용자가 웹사이트 또는 Application에 입력한 본인확인정보의 정확성 여부 확인

2. 수집항목
-성명, 생년월일, 휴대폰번호, 통신사

3. 개인정보의 보유기간 및 이용기간
-이용자가 서비스스 이용하는 기간에 한하여 보유 및 이용. 다만 아래의 경우는 제외
-법령에서 정하는 경우 해당 기간까지 보유 
(상세 사항은 회사의 개인정보취급방침에 기재된 바에 따름)

4. 개인정보의 수집 및 이용 거부
-이용자는 회사의 개인정보 수집 및 이용 동의를 거부할 수 있습니다. 단, 동의를 거부하는 경우 간편인증 서비스가 제한됩니다. 
`;
export const terms_of_service = `제 1 조 (목적)
이 약관은 H&S biolab(이하 ‘회사’)가 제공하는 간편인증 서비스(이하 ‘서비스’)의 이용과 관련하여 회사와 이용자의 권리 의무 및 책임사항을 규정함을 목적으로 합니다.

제 2 조 (약관의 명시와 개정)
1. 이 약관은 회사의 서비스 초기화면에 게시하여 공지합니다.
2. 회사는 필요하다고 인정하는 경우 관련 법령에 위배되지 않는 범위 내에서 이 약관을 개정할 수 있습니다.

제 3 조 (약관의 해석)
1. 이 약관에 명시되지 않은 사항에 대해서는 관련 법령 또는 상관례에 따릅니다.
2. 회사는 개별 서비스에 대해서는 별도의 이용약관 및 정책을 둘 수 있으며, 해당 내용이 이 약관과 상충할 경우 해당 서비스의 이용약관을 우선합니다.

제 4 조 (이용계약의 체결)
1. 이용계약은 이용자가 본 약관의 내용에 대하여 동의하고 서비스 이용을 신청한 경우 회사가 이를 승낙함으로써 체결됩니다.
2. 회사는 다음 각 호에 해당하는 이용신청에 대하여는 승낙을 하지 않을 수 있습니다.

제 5 조 (개인정보의 보호)
회사는 관계법령이 정하는 바에 따라 이용자의 개인정보를 보호하기 위해 노력하며, 이용자의 개인정보 보호에 대해서는 관계법령 및 회사의 개인정보처리방침에 따릅니다.

제 6 조 (서비스의 이용)
1. 서비스 이용은 회사의 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴, 1일 24시간 운영을 원칙으로 합니다. 단, 회사는 시스템 정기점검, 증설 및 교체를 위해 회사가 정한 날이나 시간에 서비스를 일시 중단할 수 있으며 예정된 작업으로 인한 서비스 일시 중단은 회사가 제공하는 서비스 화면에 사전에 공지합니다.
2. 회사는 긴급한 시스템 점검, 증설 및 교체, 설비의 장애, 서비스 이용의 폭주 등 부득이한 사유가 발생한 경우 사전 공지 없이 일시적으로 서비스 제공을 중단할 수 있습니다.

제 7 조 (서비스 이용의 제한 및 정지)
회사는 이용자가 다음 각 호에 해당하는 경우 사전 통지 없이 서비스의 이용을 제한하거나 중지할 수 있습니다.
1. 서비스의 운영을 고의로 방해한 경우
2. 공공질서 및 미풍양속에 반하는 경우
3. 타인의 명예를 손상시키거나 불이익을 주는 경우
4. 범죄 행위를 목적으로 하거나 기타 범죄와 관련된 행위

제 8 조 (서비스 제공의 중단)
회사는 다음 각 호에 해당하는 경우 서비스 제공을 중단할 수 있습니다.
1. 서비스용 설비의 보수 등 공사로 인한 부득이한 경우
2. 정전, 천재지변 등 불가항력적인 경우

제 9 조 (서비스 이용계약의 해지)
이용자가 서비스 이용계약을 해지하고자 할 때는 이용자 본인이 온라인을 통해 회사에 해지 신청을 하여야 합니다.

제 10 조 (면책사항)
1. 회사는 이용자의 귀책사유로 인한 서비스 이용의 장애에 대하여 책임을 지지 않습니다.
2. 회사는 이용자가 서비스를 이용하여 기대하는 이익을 얻지 못한 것에 대하여 책임을 지지 않습니다.
3. 회사는 이용자가 서비스에 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다.

제 11 조 (준법서약)
이용자는 서비스 이용과 관련하여 이용자의 규책사유로 금지행위에 해당하는 행위로 회사 또는 제3자에게 손해를 입힌 경우 배상하여야 합니다.

제 12 조 (손해배상)
회사는 서비스 이용과 관련하여 이용자에게 손해가 발생한 경우 이를 배상할 책임이 있습니다. 단, 회사는 다음 각 호에 해당하는 경우 손해배상 책임을 지지 않습니다.
1. 천재지변 또는 이에 준하는 불가항력으로 인하여 발생한 손해
2. 이용자의 고의 또는 과실로 인하여 발생한 손해
3. 기타 회사의 귀책사유가 없는 사유로 인하여 발생한 손해

제 13 조 (분쟁의 해결 및 관할법원)
1. 회사와 이용자 간에 발생한 전자상거래 분쟁에 관한 소송은 민사소송법상의 관할법원에 제기합니다.
2. 회사와 이용자 간에 제기된 전자상거래 소송에는 대한민국 법을 적용합니다.
`;

export const thrid_part_info_conset = `제3자정보제공동의(필수)

H&S biolab(이하 '회사')는 간편인증서비스 제공을 위하여
이용기관에 다음의 정보를 제공하고자 합니다.

1. 용어정의
- 인증기관 : 전자서명인증사업자 업무를 수행하는 기관
- 제공받는자 : 간편인증서비스를 이용하는 이용자가 선택한 인증기관

2. 제공하는 개인정보 항목
- 생년월일, 성명, 휴대전화번호

3. 제공 받는자의 개인정보 보유 이용기간
- 간편인증을 위한 정보 비교 후 즉시 파기

이용자는 회사에서 요구하는 개인정보 제공에 대한 동의를
거부할 수 있습니다. 단, 동의를 거부하는 경우 간편인증서
비스를 이용할 수 없습니다.
`; 